test/perf-test/benchmark_logs_20250624_1008/log_20250624_1008_input128_output128_batch32.log
[2025-06-25 00:35:03] Running input_len=128, output_len=128, batch_size=32...
INFO 06-25 00:35:08 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-25 00:35:09 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='deepseek', tokenizer='/home/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/llm-infer/test/perf-test/benchmark_logs_20250624_1008/result_20250624_1008_input128_output128_batch32.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 200/200 [01:13<00:00,  2.73it/s]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  73.33     
Total input tokens:                      25400     
Total generated tokens:                  25600     
Request throughput (req/s):              2.73      
Output token throughput (tok/s):         349.12    
Total Token throughput (tok/s):          695.50    
---------------Time to First Token----------------
Mean TTFT (ms):                          1242.03   
Median TTFT (ms):                        1335.56   
P99 TTFT (ms):                           1512.55   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          74.16     
Median TPOT (ms):                        73.73     
P99 TPOT (ms):                           82.44     
---------------Inter-token Latency----------------
Mean ITL (ms):                           74.16     
Median ITL (ms):                         73.55     
P99 ITL (ms):                            80.88     
==================================================
[2025-06-25 00:36:32] SUCCESS input_len=128 output_len=128 batch_size=32
---