test/perf-test/benchmark_logs_20250624_1008/log_20250624_1008_input128_output128_batch4.log
[2025-06-24 18:51:33] Running input_len=128, output_len=128, batch_size=4...
INFO 06-24 18:51:37 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-24 18:51:39 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://127.0.0.1:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=4, model='deepseek', tokenizer='/home/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=200, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/llm-infer/test/perf-test/benchmark_logs_20250624_1008/result_20250624_1008_input128_output128_batch4.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=128, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
100%|██████████| 200/200 [06:49<00:00,  2.05s/it]
============ Serving Benchmark Result ============
Successful requests:                     200       
Benchmark duration (s):                  409.80    
Total input tokens:                      25400     
Total generated tokens:                  25600     
Request throughput (req/s):              0.49      
Output token throughput (tok/s):         62.47     
Total Token throughput (tok/s):          124.45    
---------------Time to First Token----------------
Mean TTFT (ms):                          359.65    
Median TTFT (ms):                        359.56    
P99 TTFT (ms):                           368.34    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          61.69     
Median TPOT (ms):                        61.77     
P99 TPOT (ms):                           62.27     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.69     
Median ITL (ms):                         61.67     
P99 ITL (ms):                            69.38     
==================================================
[2025-06-24 18:58:38] SUCCESS input_len=128 output_len=128 batch_size=4
---